#include <stdio.h>
#include <string.h>
#include <time.h>

void title(void);//タイトル画面を表示させる。
void rule(void);//ルールを表示させる。
void shokika(char masu[100][100][100], int check[100][100][1]);//マスを初期化する。
void AIshokika(int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1]);//AIを初期化する。
void hyoji(char masu[100][100][100]);//盤面を表示する。
//void AIkakunin(int check[100][100][1],int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1]);//AIを表示させる。
void player(char masu[100][100][100], int check[100][100][1]);//プレイヤーが置く場所を決める。
void computer(char masu[100][100][100], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int check[100][100][1], int i1, int j1);//コンピュータが置く場所を決める。
int tatecheck(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1], int i, int j);//縦に揃ってるかチェックする。
int yokocheck(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1], int i, int j);//横に揃ってるかチェックする。
int nanamecheck(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1], int i, int j);//斜めに揃ってるかチェックする。
int hantei(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1]);//5つ揃ってるかチェックする。
int owari(int check[100][100][1]);//マスが埋まりきったら終わり。

////////////////////////////////////////////////////////////////////////////////

int main(){
	int i1,j1;//一番最初にコンピュータが置いたマス。
	int flag=1;//ループのフラグ。
	int you=0;//プレイヤーのフラグ。
	int com=0;//コンピュータのフラグ。
	int draw=0;//ドローのフラグ。
	char masu[100][100][100];//マス表示用の配列
	int check[100][100][1];//マスに何が置いてあるのかをチェックするための配列
	int AI[100][100][1];//コンピュータがどこに置くべきかを参考にするための配列
	int AI2[4][100][100][1];//コンピュータの片3記録用
	int AI3[4][100][100][1];//コンピュータの2記録用
	int AI4[4][100][100][1];//プレイヤーの片3記録用
	int AI5[4][100][100][1];//プレイヤーの2記録用
	
	title();
	rule();
	
	srand(time(NULL));//シードを設定。
	
	shokika(masu,check);//初期化。
	AIshokika(AI,AI2,AI3,AI4,AI5);//AIの初期化。
	hyoji(masu);//表示。
	
	//コンピュータが弱すぎるので、先手は取らせてあげる。
	printf("コンピュータの番です。\n");
	printf("Enterキーを押してください。\n");
	getchar();
	
	while(flag){
		i1=rand()%15;
		j1=rand()%15;
		if(i1>4 && i1<11 && j1>4 && j1<11) flag=0;
	}
	
	check[i1][j1][0]=3;//このマスに置いたよーっていう印をつける。
	strcpy(masu[i1][j1],"★");
	
	hyoji(masu);
	
	
	flag=1;//フラグを立て直す。
	while(flag){//どっちかが勝つまで終わらない。
		
		AIshokika(AI,AI2,AI3,AI4,AI5);
		
		player(masu,check);//プレイヤーのターン。
		hyoji(masu);//表示。
		
		if(hantei(check,AI,AI2,AI3,AI4,AI5)==1){//プレイヤーが勝ってるかチェック。
			you=1;
			break;
		}
		
		if(owari(check)==1){//マスが埋まりきってないかチェック。
			draw=1;
			break;
		}
		
		//AIkakunin(check,AI,AI2,AI3,AI4,AI5);
		computer(masu,AI,AI2,AI3,check,i1,j1);//コンピュータのターン。
		hyoji(masu);//表示。
		
		
		if(hantei(check,AI,AI2,AI3,AI4,AI5)==1){//コンピュータが勝ってるかチェック。
			com=1;
			break;
		}
		
		if(owari(check)==1){//マスが埋まりきってないかチェック。
			draw=1;
			break;
		}
		
	}
	if(you) printf("YOU WIN!\n");
	if(com) printf("YOU LOSE...\n");
	if(draw) printf("DRAW.\n");
	
	return 0;
}

////////////////////////////////////////////////////////////////////////////////

void title(void){//タイトル。
	printf("\n");
	
	printf("　　　　　五五五五五五五五　　　　　目目目目目目目目　　　　　　　並　　　　　並　　　　　　　　　　　　　　　　\n");
	printf("　　　　　　　　五　　　　　　　　　目　　　　　　目　　　　　　並並並並並並並並並　　　　　　べ　　べ　べ　　　\n");
	printf("　　　　　　　　五　　　　　　　　　目目目目目目目目　　　　　　　　並　　　並　　　　　　　べ　べ　べ　べ　　　\n");
	printf("　　　　　五五五五五五　　　　　　　目　　　　　　目　　　　　　並　並　　　並　並　　　　べ　　　べ　　　　　　\n");
	printf("　　　　　　　五　　五　　　　　　　目目目目目目目目　　　　　　並　　並　並　　並　　　べ　　　　　べ　　　　　\n");
	printf("　　　　　　五　　　五　　　　　　　目　　　　　　目　　　　　　　並　並　並　並　　　　　　　　　　　べ　　　　\n");
	printf("　　　　五五五五五五五五五五五　　　目目目目目目目目　　　　　並並並並並並並並並並並　　　　　　　　　　べ　　　\n");
	
	printf("\n");
	printf("Enterキーを押してください。\n");
	getchar();
	
}

////////////////////////////////////////////////////////////////////////////////

void rule(void){
	printf("〜ルール説明〜\n");
	printf("\n");
	printf("縦、横、斜めのいずれかに５個並べると勝ちです。\n");
	printf("先手はコンピュータです。\n");
	printf("長連(5個以上並べる)、三三、四四は禁じ手としません。\n");
	printf("置くマスの指定はスペース区切りで、縦を先、横を後として、2 5というように入力してください。\n");
	
	printf("\n");
	printf("始めるにはEnterキーを押してください。\n");
	getchar();
	
}

/////////////////////////////////////////////////////////////////////////////////

void shokika(char masu[100][100][100], int check[100][100][1]){//初期化。
	int i,j;
	
	for(i=0;i<15;i++){
		for(j=0;j<15;j++){
			strcpy(masu[i][j],"□");
			check[i][j][0]=1;
		}
	}
}

//////////////////////////////////////////////////////////////////////////////////

void AIshokika(int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1]){//AIの初期化。
	int i,j,k;
	for(k=0;k<4;k++){
		for(i=0;i<15;i++){
			for(j=0;j<15;j++){
				AI[i][j][0]=1;
				AI2[k][i][j][0]=0;
				AI3[k][i][j][0]=0;
				AI4[k][i][j][0]=0;
				AI5[k][i][j][0]=0;
			}
		}
	}
}

/////////////////////////////////////////////////////////////////////////////////

void hyoji(char masu[100][100][100]){//表示。
	int i,j;
	
	printf("   1 2 3 4 5 6 7 8 9 101112131415\n");
	
	for(i=0;i<15;i++){
		printf("%2d ",i+1);//頭の数を表示。
		for(j=0;j<15;j++){
			printf("%s ",masu[i][j]);
		}
		printf("\n");//行終わりに改行。
	}
	printf("\n");
}

/////////////////////////////////////////////////////////////////////////////////////

void player(char masu[100][100][100], int check[100][100][1]){//プレイヤー。
	int i,j;
	int flag=1;
	
	printf("あなたの番です。\n");
	printf("置くマスを指定してください。\n");
	
	while(flag){
		if(scanf("%d%d",&i,&j) != 2) scanf("%*s");//整数以外を入力したら、もう一度。
		if(i<1 || i>15 || j<1 || j>15) printf("もう一度入力してください。\n");//1から15の間に収まってなかったら、もう一度。
		else if(check[i-1][j-1][0]==2 || check[i-1][j-1][0]==3) printf("そのマスには置けません。\n");//既に置いてるマスには置けません。
		else flag=0;
	}
	
	scanf("%*c");//改行を空読みして処理。
	check[i-1][j-1][0]=2;//このマスに置いたよーっていう印をつける。
	strcpy(masu[i-1][j-1],"●");
	
}

/*///////////////////////////////////////////////////////////////////////////////////////

AI数値表

4000 自分が4,飛び4//即勝利
//3000 自分が33(禁じ手),44(禁じ手),長連(禁じ手)//打ったら即敗北(打てない)
400 相手が4,飛び4//打たなきゃ即敗北
310 自分が34,44//打ったら勝利確定
300 自分が3,飛び3//優先順位が落ちる。
31 相手が34,44//打たなきゃ敗北確定
30 相手が3,飛び3//こっちの方が優先順位が落ちる
20 自分が33//速度的に優先順位は落ちる
10 相手が33//速度的に優先順位は落ちる
//こっから下は別配列で管理。
AI2 自分が片3、片飛び3
AI3 自分が2、飛び2
AI4 相手が片3、片飛び3
AI5 相手が2、飛び2

//////////////////////////////////////////////////////////////////////////////////////*/

void computer(char masu[100][100][100], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int check[100][100][1], int i1, int j1){//コンピュータ。
	int i,j,k;
	
	int randam=1;//ランダム用のフラグ
	int victory=0;//自分が4つ(飛び4を含む)揃ってる時のフラグ
	int stop=0;//相手が4つ(飛び4を含む)の同上
	int conviction1=0;//自分が34,44の同上
	int conviction2=0;//自分が3つ(飛び3を含む)の同上
	int intercept1=0;//相手が34,44の同上
	int intercept2=0;//相手が3つ(飛び3を含む)の同上
	int threethree1=0;//自分が33の同上
	int threethree2=0;//相手が33の同上
	int attack=0;//自分が2(飛び2も含むが優先順位は低い)もしくは片3(片飛び3を含む)の同上
	int near=0;//とりあえず最初に置いたとこの周辺が置けそうな時の同上
	int flag=1;//attack中のフラグ
	int flag2=1;//同上
	
	int tmp,tmp0;//自分が4つ(飛び4を含む)揃ってるとき用の座標の一時保存。
	int tmp1,tmp2;//相手が4つ(飛び4を含む)の同上
	int tmp3,tmp4;//自分が34,44の同上
	int tmp5,tmp6;//自分が3つ(飛び3を含む)の同上
	int tmp7,tmp8;//相手が34,44の同上
	int tmp9,tmp10;//相手が3つ(飛び3を含む)の同上
	int tmp11,tmp12;//自分が33の同上
	int tmp13,tmp14;//相手が33の同上
	int tmp15,tmp16;//自分が2(飛び2も含むが優先順位は低い)もしくは片3(片飛び3を含む)の時の同上
	int tmp17,tmp18;//最初の周辺の同上
	
	printf("コンピュータの番です。\n");
	printf("Enterキーを押してください。\n");
	getchar();
	
	for(i=0;i<15;i++){
		for(j=0;j<15;j++){
			if(AI[i][j][0]==4000){//コンピュータ4
				if(check[i][j][0]==1){
					randam=0;
					victory=1;
					tmp=i;
					tmp0=j;
					break;
				}
			}
			if(AI[i][j][0]==400){//プレイヤー4
				if(check[i][j][0]==1){
					randam=0;
					stop=1;
					tmp1=i;
					tmp2=j;
				}
			}
			if(AI[i][j][0]==310){//コンピュータ34,44
				if(check[i][j][0]==1){
					randam=0;
					conviction1=1;
					tmp3=i;
					tmp4=j;
				}
			}
			if(AI[i][j][0]==300){//コンピュータ3,飛び3
				if(check[i][j][0]==1){
					randam=0;
					conviction2=1;
					tmp5=i;
					tmp6=j;
				}
			}
			if(AI[i][j][0]==31){//プレイヤー34,44
				if(check[i][j][0]==1){
					randam=0;
					intercept1=1;
					tmp7=i;
					tmp8=j;
				}
			}
			if(AI[i][j][0]==30){//プレイヤー3,飛び3
				if(check[i][j][0]==1){
					randam=0;
					intercept2=1;
					tmp9=i;
					tmp10=j;
				}
			}
			if(AI[i][j][0]==20){//コンピュータ33
				if(check[i][j][0]==1){
					randam=0;
					threethree1=1;
					tmp11=i;
					tmp12=j;
				}
			}
			if(AI[i][j][0]==10){//プレイヤー33
				if(check[i][j][0]==1){
					randam=0;
					threethree2=1;
					tmp13=i;
					tmp14=j;
				}
			}
			for(k=0;k<4;k++){
				if(AI2[k][i][j][0]==1 || AI3[k][i][j][0]>=1){//コンピュータ2、飛び3、片3、片飛び3
					if(check[i][j][0]==1){
						if(flag) if(AI3[k][i][j][0]==1){
							randam=0;
							attack=1;
							tmp15=i;
							tmp16=j;
						}
						if(flag2) if(AI3[k][i][j][0]==2){
							randam=0;
							flag=0;
							attack=1;
							tmp15=i;
							tmp16=j;
						}
						if(AI2[k][i][j][0]==1){
							randam=0;
							flag=0;
							flag2=0;
							attack=1;
							tmp15=i;
							tmp16=j;
						}
					}
				}
			}
		}
		if(victory==1) break;
	}
	
	for(i=-1;i<2;i++){//最初に置いたとこの周辺に置かせてみる。
		for(j=-1;j<2;j++){
			if(check[i1+i][j1+j][0]==1){
				randam=0;
				near=1;
				tmp17=i1+i;
				tmp18=j1+j;
			}
		}
	}
	
	while(randam){
		i=rand()%15;
		j=rand()%15;
		if(check[i][j][0]==1) randam=0;//まだ置いてないマスならおっけー。
	}
	
	if(near){//最初置いたとこの周辺
		i=tmp17;
		j=tmp18;
	}
	if(attack){//コンピュータ2、飛び2、片3
		i=tmp15;
		j=tmp16;
	}
	if(threethree2){//プレイヤー33
		i=tmp13;
		j=tmp14;
	}
	if(threethree1){//コンピュータ33
		i=tmp11;
		j=tmp12;
	}
	if(intercept2){//プレイヤー3、飛び3
		i=tmp9;
		j=tmp10;
	}
	if(intercept1){//プレイヤー34、44
		i=tmp7;
		j=tmp8;
	}
	if(conviction2){//コンピュータ3、飛び3
		i=tmp5;
		j=tmp6;
	}
	if(conviction1){//コンピュータ34,44
		i=tmp3;
		j=tmp4;
	}
	if(stop){//プレイヤー4、飛び4
		i=tmp1;
		j=tmp2;
	}
	if(victory){//コンピュータ4、飛び4
		i=tmp;
		j=tmp0;
	}
	
	check[i][j][0]=3;//このマスに置いたよーっていう印をつける。
	strcpy(masu[i][j],"★");
}

/////////////////////////////////////////////////////////////////////////////////////////

int tatecheck(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1], int i, int j){//縦チェック。
	int kekka=0;
	int k;
	
	//逆サイドに置かれてないかを確認した上で3、飛び3は認識させる。
	
	if(check[i][j][0]==2){//プレイヤー側の判定
		if(check[i+3][j][0]==2) if(check[i-1][j][0]==1 && check[i+1][j][0]==1 && check[i+2][j][0]==1 && check[i+4][j][0]==1){
			AI5[0][i+1][j][0]=1;//飛び飛びの2チェック
			AI5[0][i+2][j][0]=1;//飛び飛びの2チェック
		}
		if(check[i+2][j][0]==2) if(check[i-1][j][0]==1 && check[i+1][j][0]==1 && check[i+3][j][0]==1){
			for(k=0;k<4;k++){
				if(AI5[k][i+1][j][0]>=1) if(AI[i+1][j][0]<10) AI[i+1][j][0]=10;//33
				if(AI4[k][i+1][j][0]==1) if(AI[i+1][j][0]<31) AI[i+1][j][0]=31;//34
			}
			AI5[0][i+1][j][0]=1;//飛び2チェック
			if(check[i-2][j][0]==1) AI5[0][i-1][j][0]=1;//飛び2チェック
			if(check[i+4][j][0]==1) AI5[0][i+3][j][0]=1;//飛び2チェック
			if(check[i+4][j][0]==2){
				AI5[0][i+1][j][0]=0;//2のリセット
				AI5[0][i+3][j][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i+1][j][0]==1) if(AI[i+1][j][0]<31) AI[i+1][j][0]=31;//4が31の44
					if(AI5[k][i+1][j][0]>=1) if(AI[i+1][j][0]<31) AI[i+1][j][0]=31;//4が31の43
					if(AI4[k][i+3][j][0]==1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//4が13の44
					if(AI5[k][i+3][j][0]>=1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//4が13の43
				}
				AI4[0][i+1][j][0]=1;//31の飛び3チェック
				AI4[0][i+3][j][0]=1;//13の飛び3チェック
			}
		}
		if(check[i+1][j][0]==2){///////////////////////////////////////////////
			if(check[i-1][j][0]==1 && check[i+2][j][0]==1){
				if(check[i-2][j][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i-1][j][0]>=1) if(AI[i-1][j][0]<10) AI[i-1][j][0]=10;//33
						if(AI4[k][i-1][j][0]==1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//34
					}
					AI5[0][i-1][j][0]=2;//2チェック
				}
				if(check[i-3][j][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i-2][j][0]>=1) if(AI[i-2][j][0]<10) AI[i-2][j][0]=10;//33
						if(AI4[k][i-2][j][0]==1) if(AI[i-2][j][0]<31) AI[i-2][j][0]=31;//34
					}
					AI5[0][i-2][j][0]=1;//2の飛び3部分チェック
				}
				if(check[i+3][j][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i+2][j][0]>=1) if(AI[i+2][j][0]<10) AI[i+2][j][0]=10;//33
						if(AI4[k][i+2][j][0]==1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//34
					}
					AI5[0][i+2][j][0]=2;//2チェック
				}
				if(check[i+4][j][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i+3][j][0]>=1) if(AI[i+3][j][0]<10) AI[i+3][j][0]=10;//33
						if(AI4[k][i+3][j][0]==1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//34
					}
					AI5[0][i+3][j][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i+3][j][0]==2){
				AI5[0][i+4][j][0]=0;//2のリセット
				AI5[0][i-1][j][0]=0;//2のリセット
				AI5[0][i+2][j][0]=0;//2のリセット
				if(check[i-1][j][0]==1 && check[i+4][j][0]==1) if(AI[i+2][j][0]<30) AI[i+2][j][0]=30;//21の飛び3
				if(check[i+4][j][0]==2) AI[i+2][j][0]=400;//22の飛び4
				if(check[i+2][j][0]==1){
					if(check[i-1][j][0]==1 || check[i+4][j][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i+2][j][0]==1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//4がストレートの44
							if(AI5[k][i+2][j][0]>=1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//4がストレートの43
						}
						AI4[0][i+2][j][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i+4][j][0]==1) if(AI[i+4][j][0]<31) AI[i+4][j][0]=31;//4が22の44
						if(AI5[k][i+4][j][0]>=1) if(AI[i+4][j][0]<31) AI[i+4][j][0]=31;//4が22の43
						if(AI4[k][i-1][j][0]==1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4が31の44
						if(AI5[k][i-1][j][0]>=1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4が31の43
					}
					AI4[0][i+4][j][0]=1;//飛び3チェック
					AI4[0][i-1][j][0]=1;//飛び3チェック
				}
			}
			if(check[i-2][j][0]==2){
				AI5[0][i-1][j][0]=0;//2のリセット
				AI5[0][i-3][j][0]=0;//2のリセット
				AI5[0][i+2][j][0]=0;//2のリセット
				if(check[i-3][j][0]==1 && check[i+2][j][0]==1) if(AI[i-1][j][0]<30) AI[i-1][j][0]=30;//12の飛び3
				if(check[i-1][j][0]==1){
					if(check[i+2][j][0]==1 || check[i-3][j][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i-1][j][0]==1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4がストレートの44
							if(AI5[k][i-1][j][0]>=1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4がストレートの43
						}
						AI4[0][i-1][j][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i+2][j][0]==1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//4が13の44
						if(AI5[k][i+2][j][0]>=1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//4が13の43
						if(AI4[k][i-3][j][0]==1) if(AI[i-3][j][0]<31) AI[i-3][j][0]=31;//4が22の44
						if(AI5[k][i-3][j][0]>=1) if(AI[i-3][j][0]<31) AI[i-3][j][0]=31;//4が22の43
					}
					AI4[0][i+2][j][0]=1;//飛び3チェック
					AI4[0][i-3][j][0]=1;//飛び3チェック
				}
			}
			if(check[i+4][j][0]==2){
				if(check[i+2][j][0]==1 && check[i+3][j][0]==1){
					AI5[0][i+2][j][0]=0;//2のリセット
					AI5[0][i+3][j][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i+2][j][0]==1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//4が31の44
						if(AI5[k][i+2][j][0]>=1) if(AI[i+2][j][0]<31) AI[i+2][j][0]=31;//4が31の43
						if(AI4[k][i+3][j][0]==1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//4が22の44
						if(AI5[k][i+3][j][0]>=1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//4が22の43
					}
					AI4[0][i+2][j][0]=1;//飛び3チェック
					AI4[0][i+3][j][0]=1;//飛び3チェック
				}
			}
			if(check[i-3][j][0]==2){
				if(check[i-1][j][0]==1 && check[i-2][j][0]==1){
					AI5[0][i-1][j][0]=0;//2のリセット
					AI5[0][i-2][j][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i-1][j][0]==1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4が13の44
						if(AI5[k][i-1][j][0]>=1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4が13の43
						if(AI4[k][i-2][j][0]==1) if(AI[i-2][j][0]<31) AI[i-2][j][0]=31;//4が22の44
						if(AI5[k][i-2][j][0]>=1) if(AI[i-2][j][0]<31) AI[i-2][j][0]=31;//4が22の43
					}
					AI4[0][i-1][j][0]=1;//飛び3チェック
					AI4[0][i-2][j][0]=1;//飛び3チェック
				}
			}
			if(check[i+2][j][0]==2){///////////////////////////////////////////////////////////////////////////
				AI5[0][i+3][j][0]=0;//2のリセット
				AI5[0][i+4][j][0]=0;//2のリセット
				AI5[0][i-1][j][0]=0;//2のリセット
				AI5[0][i-2][j][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i-1][j][0]==1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4がストレートの44
					if(AI5[k][i-1][j][0]>=1) if(AI[i-1][j][0]<31) AI[i-1][j][0]=31;//4がストレートの43
					if(AI4[k][i+3][j][0]==1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//4がストレートの44
					if(AI5[k][i+3][j][0]>=1) if(AI[i+3][j][0]<31) AI[i+3][j][0]=31;//4がストレートの43
				}
				if(check[i-1][j][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i-2][j][0]==1) if(AI[i-2][j][0]<31) AI[i-2][j][0]=31;//4が13の44
						if(AI5[k][i-2][j][0]>=1) if(AI[i-2][j][0]<31) AI[i-2][j][0]=31;//4が13の43
					}
					if(check[i+4][j][0]==1) if(AI[i+3][j][0]<30) AI[i+3][j][0]=30;//3
					AI4[0][i-2][j][0]=1;//飛び3チェック
				}
				if(check[i+3][j][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i+4][j][0]==1) if(AI[i+4][j][0]<31) AI[i+4][j][0]=31;//4が31の44
						if(AI5[k][i+4][j][0]>=1) if(AI[i+4][j][0]<31) AI[i+4][j][0]=31;//4が31の43
					}
					if(check[i-2][j][0]==1) if(AI[i-1][j][0]<30) AI[i-1][j][0]=30;//3
					AI4[0][i+4][j][0]=1;//飛び3チェック
				}
				if(check[i+4][j][0]==1 || check[i-1][j][0]==1) AI4[0][i+3][j][0]=1;//3チェック
				if(check[i-2][j][0]==1 || check[i+3][j][0]==1) AI4[0][i-1][j][0]=1;//3チェック
				if(check[i+4][j][0]==2) if(AI[i+3][j][0]<400) AI[i+3][j][0]=400;//31の飛び4
				if(check[i-2][j][0]==2) if(AI[i-1][j][0]<400) AI[i-1][j][0]=400;//13の飛び4
				if(check[i+3][j][0]==2){////////////////////////////////////////////////////////
					if(AI[i+4][j][0]<400) AI[i+4][j][0]=400;//4
					if(AI[i-1][j][0]<400) AI[i-1][j][0]=400;//4
					if(check[i+4][j][0]==2){////////////////////////////////////////////////////
						kekka=1;//5ができてれば1を返して終了。
					}
				}
			}
		}
	}
	
	
	
	
	if(check[i][j][0]==3){//コンピュータ側の判定
		if(check[i+3][j][0]==3) if(check[i-1][j][0]==1 && check[i+1][j][0]==1 && check[i+2][j][0]==1 && check[i+4][j][0]==1){
			AI3[0][i+1][j][0]=1;//飛び飛びの2チェック
			AI3[0][i+2][j][0]=1;//飛び飛びの2チェック
		}
		if(check[i+2][j][0]==3) if(check[i-1][j][0]==1 && check[i+1][j][0]==1 && check[i+3][j][0]==1){
			for(k=0;k<4;k++){
				if(AI3[k][i+1][j][0]>=1) if(AI[i+1][j][0]<20) AI[i+1][j][0]=20;//33
				if(AI2[k][i+1][j][0]==1) if(AI[i+1][j][0]<310) AI[i+1][j][0]=310;//34
			}
			AI3[0][i+1][j][0]=1;//飛び2チェック
			if(check[i-2][j][0]==1) AI3[0][i-1][j][0]=1;//飛び2チェック
			if(check[i+4][j][0]==1) AI3[0][i+3][j][0]=1;//飛び2チェック
			if(check[i+4][j][0]==3){
				AI3[0][i+1][j][0]=0;//2のリセット
				AI3[0][i+3][j][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i+1][j][0]==1) if(AI[i+1][j][0]<310) AI[i+1][j][0]=310;//4が31の44
					if(AI3[k][i+1][j][0]>=1) if(AI[i+1][j][0]<310) AI[i+1][j][0]=310;//4が31の43
					if(AI2[k][i+3][j][0]==1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//4が13の44
					if(AI3[k][i+3][j][0]>=1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//4が13の43
				}
				AI2[0][i+1][j][0]=1;//31の飛び3チェック
				AI2[0][i+3][j][0]=1;//13の飛び3チェック
			}
		}
		if(check[i+1][j][0]==3){////////////////////////////////////////////////////////////////////////////////
			if(check[i-1][j][0]==1 && check[i+2][j][0]==1){
				if(check[i-2][j][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i-1][j][0]>=1) if(AI[i-1][j][0]<20) AI[i-1][j][0]=20;//33
						if(AI2[k][i-1][j][0]==1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//34
					}
					AI3[0][i-1][j][0]=2;//2チェック
				}
				if(check[i-3][j][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i-2][j][0]>=1) if(AI[i-2][j][0]<20) AI[i-2][j][0]=20;//33
						if(AI2[k][i-2][j][0]==1) if(AI[i-2][j][0]<310) AI[i-2][j][0]=310;//34
					}
					AI3[0][i-2][j][0]=1;//2の飛び3部分チェック
				}
				if(check[i+3][j][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i+2][j][0]>=1) if(AI[i+2][j][0]<20) AI[i+2][j][0]=20;//33
						if(AI2[k][i+2][j][0]==1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//34
					}
					AI3[0][i+2][j][0]=2;//2チェック
				}
				if(check[i+4][j][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i+3][j][0]>=1) if(AI[i+3][j][0]<20) AI[i+3][j][0]=20;//33
						if(AI2[k][i+3][j][0]==1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//34
					}
					AI3[0][i+3][j][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i+3][j][0]==3){
				AI3[0][i+4][j][0]=0;//2のリセット
				AI3[0][i-1][j][0]=0;//2のリセット
				AI3[0][i+2][j][0]=0;//2のリセット
				if(check[i+2][j][0]==1){
					if(check[i-1][j][0]==1 || check[i+4][j][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i+2][j][0]==1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//4がストレートの44
							if(AI3[k][i+2][j][0]>=1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//4がストレートの43
						}
						AI2[0][i+2][j][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i+4][j][0]==1) if(AI[i+4][j][0]<310) AI[i+4][j][0]=310;//4が22の44
						if(AI3[k][i+4][j][0]>=1) if(AI[i+4][j][0]<310) AI[i+4][j][0]=310;//4が22の43
						if(AI2[k][i-1][j][0]==1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4が31の44
						if(AI3[k][i-1][j][0]>=1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4が31の43
					}
					AI2[0][i+4][j][0]=1;//飛び3チェック
					AI2[0][i-1][j][0]=1;//飛び3チェック
				}
				if(check[i-1][j][0]==1 && check[i+4][j][0]==1) if(AI[i+2][j][0]<300) AI[i+2][j][0]=300;//21の飛び3
				if(check[i+4][j][0]==3) AI[i+2][j][0]=4000;//22の飛び4
			}
			if(check[i-2][j][0]==3){
				AI3[0][i-1][j][0]=0;//2のリセット
				AI3[0][i-3][j][0]=0;//2のリセット
				AI3[0][i+2][j][0]=0;//2のリセット
				if(check[i-1][j][0]==1){
					if(check[i+2][j][0]==1 || check[i-3][j][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i-1][j][0]==1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4がストレートの44
							if(AI3[k][i-1][j][0]>=1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4がストレートの43
						}
						AI2[0][i-1][j][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i+2][j][0]==1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//4が13の44
						if(AI3[k][i+2][j][0]>=1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//4が13の43
						if(AI2[k][i-3][j][0]==1) if(AI[i-3][j][0]<310) AI[i-3][j][0]=310;//4が22の44
						if(AI3[k][i-3][j][0]>=1) if(AI[i-3][j][0]<310) AI[i-3][j][0]=310;//4が22の43
					}
					AI2[0][i+2][j][0]=1;//飛び3チェック
					AI2[0][i-3][j][0]=1;//飛び3チェック
				}
				if(check[i-3][j][0]==1 && check[i+2][j][0]==1) if(AI[i-1][j][0]<300) AI[i-1][j][0]=300;//12の飛び3
			}
			if(check[i+4][j][0]==3){
				if(check[i+2][j][0]==1 && check[i+3][j][0]==1){
					AI3[0][i+2][j][0]=0;//2のリセット
					AI3[0][i+3][j][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i+2][j][0]==1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//4が31の44
						if(AI3[k][i+2][j][0]>=1) if(AI[i+2][j][0]<310) AI[i+2][j][0]=310;//4が31の43
						if(AI2[k][i+3][j][0]==1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//4が22の44
						if(AI3[k][i+3][j][0]>=1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//4が22の43
					}
					AI2[0][i+2][j][0]=1;//飛び3チェック
					AI2[0][i+3][j][0]=1;//飛び3チェック
				}
			}
			if(check[i-3][j][0]==3){
				if(check[i-1][j][0]==1 && check[i-2][j][0]==1){
					AI3[0][i-1][j][0]=0;//2のリセット
					AI3[0][i-2][j][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i-1][j][0]==1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4が13の44
						if(AI3[k][i-1][j][0]>=1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4が13の43
						if(AI2[k][i-2][j][0]==1) if(AI[i-2][j][0]<310) AI[i-2][j][0]=310;//4が22の44
						if(AI3[k][i-2][j][0]>=1) if(AI[i-2][j][0]<310) AI[i-2][j][0]=310;//4が22の43
					}
					AI2[0][i-1][j][0]=1;//飛び3チェック
					AI2[0][i-2][j][0]=1;//飛び3チェック
				}
			}
			if(check[i+2][j][0]==3){//////////////////////////////////////////////////////////////
				AI3[0][i+3][j][0]=0;//2のリセット
				AI3[0][i+4][j][0]=0;//2のリセット
				AI3[0][i-1][j][0]=0;//2のリセット
				AI3[0][i-2][j][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i-1][j][0]==1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4がストレートの44
					if(AI3[k][i-1][j][0]>=1) if(AI[i-1][j][0]<310) AI[i-1][j][0]=310;//4がストレートの43
					if(AI2[k][i+3][j][0]==1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//4がストレートの44
					if(AI3[k][i+3][j][0]>=1) if(AI[i+3][j][0]<310) AI[i+3][j][0]=310;//4がストレートの43
				}
				if(check[i-1][j][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i-2][j][0]==1) if(AI[i-2][j][0]<310) AI[i-2][j][0]=310;//4が13の44
						if(AI3[k][i-2][j][0]>=1) if(AI[i-2][j][0]<310) AI[i-2][j][0]=310;//4が13の43
					}
					AI2[0][i-2][j][0]=1;//飛び3チェック
					if(check[i+4][j][0]==1) if(AI[i+3][j][0]<300) AI[i+3][j][0]=300;//3
				}
				if(check[i+3][j][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i+4][j][0]==1) if(AI[i+4][j][0]<310) AI[i+4][j][0]=310;//4が31の44
						if(AI3[k][i+4][j][0]>=1) if(AI[i+4][j][0]<310) AI[i+4][j][0]=310;//4が31の43
					}
					AI2[0][i+4][j][0]=1;//飛び3チェック
					if(check[i-2][j][0]==1) if(AI[i-1][j][0]<300) AI[i-1][j][0]=300;//3
				}
				if(check[i+4][j][0]==1 || check[i-1][j][0]==1) AI2[0][i+3][j][0]=1;//3チェック
				if(check[i-2][j][0]==1 || check[i+3][j][0]==1) AI2[0][i-1][j][0]=1;//3チェック
				if(check[i+4][j][0]==3) AI[i+3][j][0]=4000;//31の飛び4
				if(check[i-2][j][0]==3) AI[i-1][j][0]=4000;//13の飛び4
				if(check[i+3][j][0]==3){///////////////////////////////////////////////////
					AI[i+4][j][0]=4000;//4
					AI[i-1][j][0]=4000;//4
					if(check[i+4][j][0]==3){////////////////////////////////////////////////
						kekka=1;//5ができていれば1を返して終了。
					}
				}
			}
		}
	}
	
	return kekka;
}

///////////////////////////////////////////////////////////////////////////////////////////////

int yokocheck(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1], int i, int j){//横チェック。
	int kekka=0;
	int k;
	
	//逆サイドに置かれてないかを確認した上で3、飛び3は認識させる。
	
	if(check[i][j][0]==2){//プレイヤー側の判定
		if(check[i][j+3][0]==2) if(check[i][j-1][0]==1 && check[i][j+1][0]==1 && check[i][j+2][0]==1 && check[i][j+4][0]==1){
			AI5[1][i][j+1][0]=1;//飛び飛びの2チェック
			AI5[1][i][j+2][0]=1;//飛び飛びの2チェック
		}
		if(check[i][j+2][0]==2) if(check[i][j-1][0]==1 && check[i][j+1][0]==1 && check[i][j+3][0]==1){
			for(k=0;k<4;k++){
				if(AI5[k][i][j+1][0]>=1) if(AI[i][j+1][0]<10) AI[i][j+1][0]=10;//33
				if(AI4[k][i][j+1][0]==1) if(AI[i][j+1][0]<31) AI[i][j+1][0]=31;//34
			}
			AI5[1][i][j+1][0]=1;//飛び2チェック
			if(check[i][j-2][0]==1) AI5[1][i][j-1][0]=1;//飛び2チェック
			if(check[i][j+4][0]==1) AI5[1][i][j+3][0]=1;//飛び2チェック
			if(check[i][j+4][0]==2){
				AI5[1][i][j+1][0]=0;//2のリセット
				AI5[1][i][j+3][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i][j+1][0]==1) if(AI[i][j+1][0]<31) AI[i][j+1][0]=31;//4が31の44
					if(AI5[k][i][j+1][0]>=1) if(AI[i][j+1][0]<31) AI[i][j+1][0]=31;//4が31の43
					if(AI4[k][i][j+3][0]==1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//4が13の44
					if(AI5[k][i][j+3][0]>=1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//4が13の43
				}
				AI4[1][i][j+1][0]=1;//31の飛び3チェック
				AI4[1][i][j+3][0]=1;//13の飛び3チェック
			}	
		}
		if(check[i][j+1][0]==2){///////////////////////////////////////////////////////////////////////////////////////////
			if(check[i][j-1][0]==1 && check[i][j+2][0]==1){
				if(check[i][j-2][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i][j-1][0]>=1) if(AI[i][j-1][0]<10) AI[i][j-1][0]=10;//33
						if(AI4[k][i][j-1][0]==1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//34
					}
					AI5[1][i][j-1][0]=2;//2チェック
				}
				if(check[i][j-3][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i][j-2][0]>=1) if(AI[i][j-2][0]<10) AI[i][j-2][0]=10;//33
						if(AI4[k][i][j-2][0]==1) if(AI[i][j-2][0]<31) AI[i][j-2][0]=31;//34
					}
					AI5[1][i][j-2][0]=1;//2の飛び3部分チェック
				}
				if(check[i][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i][j+2][0]>=1) if(AI[i][j+2][0]<10) AI[i][j+2][0]=10;//33
						if(AI4[k][i][j+2][0]==1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//34
					}
					AI5[1][i][j+2][0]=2;//2チェック
				}
				if(check[i][j+4][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i][j+3][0]>=1) if(AI[i][j+3][0]<10) AI[i][j+3][0]=10;//33
						if(AI4[k][i][j+3][0]==1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//34
					}
					AI5[1][i][j+3][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i][j+3][0]==2){
				AI5[1][i][j+4][0]=0;//2のリセット
				AI5[1][i][j-1][0]=0;//2のリセット
				AI5[1][i][j+2][0]=0;//2のリセット
				if(check[i][j+2][0]==1){
					if(check[i][j-1][0]==1 || check[i][j+4][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i][j+2][0]==1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//4がストレートの44
							if(AI5[k][i][j+2][0]>=1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//4がストレートの43
						}
						AI4[1][i][j+2][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i][j+4][0]==1) if(AI[i][j+4][0]<31) AI[i][j+4][0]=31;//4が22の44
						if(AI5[k][i][j+4][0]>=1) if(AI[i][j+4][0]<31) AI[i][j+4][0]=31;//4が22の43
						if(AI4[k][i][j-1][0]==1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4が31の44
						if(AI5[k][i][j-1][0]>=1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4が31の43
					}
					AI4[1][i][j+4][0]=1;//飛び3チェック
					AI4[1][i][j-1][0]=1;//飛び3チェック
				}
				if(check[i][j-1][0]==1 && check[i][j+4][0]==1) if(AI[i][j+2][0]<30) AI[i][j+2][0]=30;//21の飛び3
				if(check[i][j+4][0]==2) AI[i][j+2][0]=400;//22の飛び4
			}
			if(check[i][j-2][0]==2){
				AI5[1][i][j-1][0]=0;//2のリセット
				AI5[1][i][j-3][0]=0;//2のリセット
				AI5[1][i][j+2][0]=0;//2のリセット
				if(check[i][j-1][0]==1){
					if(check[i][j+2][0]==1 || check[i][j-3][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i][j-1][0]==1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4がストレートの44
							if(AI5[k][i][j-1][0]>=1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4がストレートの43
						}
						AI4[1][i][j-1][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i][j+2][0]==1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//4が13の44
						if(AI5[k][i][j+2][0]>=1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//4が13の43
						if(AI4[k][i][j-3][0]==1) if(AI[i][j-3][0]<31) AI[i][j-3][0]=31;//4が22の44
						if(AI5[k][i][j-3][0]>=1) if(AI[i][j-3][0]<31) AI[i][j-3][0]=31;//4が22の43
					}
					AI4[1][i][j+2][0]=1;//飛び3チェック
					AI4[1][i][j-3][0]=1;//飛び3チェック
				}
				if(check[i][j-3][0]==1 && check[i][j+2][0]==1) if(AI[i][j-1][0]<30) AI[i][j-1][0]=30;//12の飛び3
			}
			if(check[i][j+4][0]==2){
				if(check[i][j+2][0]==1 && check[i][j+3][0]==1){
					AI5[1][i][j+2][0]=0;//2のリセット
					AI5[1][i][j+3][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i][j+2][0]==1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//4が31の44
						if(AI5[k][i][j+2][0]>=1) if(AI[i][j+2][0]<31) AI[i][j+2][0]=31;//4が31の43
						if(AI4[k][i][j+3][0]==1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//4が22の44
						if(AI5[k][i][j+3][0]>=1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//4が22の43
					}
					AI4[1][i][j+2][0]=1;//飛び3チェック
					AI4[1][i][j+3][0]=1;//飛び3チェック
				}
			}
			if(check[i][j-3][0]==2){
				if(check[i][j-1][0]==1 && check[i][j-2][0]==1){
					AI5[1][i][j-1][0]=0;//2のリセット
					AI5[1][i][j-2][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i][j-1][0]==1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4が13の44
						if(AI5[k][i][j-1][0]>=1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4が13の43
						if(AI4[k][i][j-2][0]==1) if(AI[i][j-2][0]<31) AI[i][j-2][0]=31;//4が22の44
						if(AI5[k][i][j-2][0]>=1) if(AI[i][j-2][0]<31) AI[i][j-2][0]=31;//4が22の43
					}
					AI4[1][i][j-1][0]=1;//飛び3チェック
					AI4[1][i][j-2][0]=1;//飛び3チェック
				}
			}
			if(check[i][j+2][0]==2){//////////////////////////////////////////////////////////////////////////////////
				AI5[1][i][j+3][0]=0;//2のリセット
				AI5[1][i][j+4][0]=0;//2のリセット
				AI5[1][i][j-1][0]=0;//2のリセット
				AI5[1][i][j-2][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i][j-1][0]==1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4がストレートの44
					if(AI5[k][i][j-1][0]>=1) if(AI[i][j-1][0]<31) AI[i][j-1][0]=31;//4がストレートの43
					if(AI4[k][i][j+3][0]==1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//4がストレートの44
					if(AI5[k][i][j+3][0]>=1) if(AI[i][j+3][0]<31) AI[i][j+3][0]=31;//4がストレートの43
				}
				if(check[i][j-1][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i][j-2][0]==1) if(AI[i][j-2][0]<31) AI[i][j-2][0]=31;//4が13の44
						if(AI5[k][i][j-2][0]>=1) if(AI[i][j-2][0]<31) AI[i][j-2][0]=31;//4が13の43
					}
					AI4[1][i][j-2][0]=1;//飛び3チェック
					if(check[i][j+4][0]==1) if(AI[i][j+3][0]<30) AI[i][j+3][0]=30;//3
				}
				if(check[i][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i][j+4][0]==1) if(AI[i][j+4][0]<31) AI[i][j+4][0]=31;//4が31の44
						if(AI5[k][i][j+4][0]>=1) if(AI[i][j+4][0]<31) AI[i][j+4][0]=31;//4が31の43
					}
					AI4[1][i][j+4][0]=1;//飛び3チェック
					if(check[i][j-2][0]==1) if(AI[i][j-1][0]<30) AI[i][j-1][0]=30;//3
				}
				if(check[i][j+4][0]==1 || check[i][j-1][0]==1) AI4[1][i][j+3][0]=1;//3チェック
				if(check[i][j-2][0]==1 || check[i][j+3][0]==1) AI4[1][i][j-1][0]=1;//3チェック
				if(check[i][j+4][0]==2) if(AI[i][j+3][0]<400) AI[i][j+3][0]=400;//31の飛び4
				if(check[i][j-2][0]==2) if(AI[i][j-1][0]<400) AI[i][j-1][0]=400;//13の飛び4
				if(check[i][j+3][0]==2){///////////////////////////////////////////////////////////
					if(AI[i][j+4][0]<400) AI[i][j+4][0]=400;//4
					if(AI[i][j-1][0]<400) AI[i][j-1][0]=400;//4
					if(check[i][j+4][0]==2){//////////////////////////////////////////////////////
						kekka=1;//5ができてれば1を返して終了。
					}
				}
			}
		}
	}
	
	
	
	if(check[i][j][0]==3){//コンピュータ側の判定
		if(check[i][j+3][0]==3) if(check[i][j-1][0]==1 && check[i][j+1][0]==1 && check[i][j+2][0]==1 && check[i][j+4][0]==1){
			AI3[1][i][j+1][0]=1;//飛び飛びの2チェック
			AI3[1][i][j+2][0]=1;//飛び飛びの2チェック
		}
		if(check[i][j+2][0]==3) if(check[i][j-1][0]==1 && check[i][j+1][0]==1 && check[i][j+3][0]==1){
			for(k=0;k<4;k++){
				if(AI3[k][i][j+1][0]>=1) if(AI[i][j+1][0]<20) AI[i][j+1][0]=20;//33
				if(AI2[k][i][j+1][0]==1) if(AI[i][j+1][0]<310) AI[i][j+1][0]=310;//34
			}
			AI3[1][i][j+1][0]=1;//飛び2チェック
			if(check[i][j-2][0]==1) AI3[1][i][j-1][0]=1;//飛び2チェック
			if(check[i][j+4][0]==1) AI3[1][i][j+3][0]=1;//飛び2チェック
			if(check[i][j+4][0]==3){
				AI3[1][i][j+1][0]=0;//2のリセット
				AI3[1][i][j+3][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i][j+1][0]==1) if(AI[i][j+1][0]<310) AI[i][j+1][0]=310;//4が31の44
					if(AI3[k][i][j+1][0]>=1) if(AI[i][j+1][0]<310) AI[i][j+1][0]=310;//4が31の43
					if(AI2[k][i][j+3][0]==1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//4が13の44
					if(AI3[k][i][j+3][0]>=1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//4が13の43
				}
				AI2[1][i][j+1][0]=1;//31の飛び3チェック
				AI2[1][i][j+3][0]=1;//13の飛び3チェック
			}
		}
		if(check[i][j+1][0]==3){/////////////////////////////////////////////////////////////////////////////////////////////////
			if(check[i][j-1][0]==1 && check[i][j+2][0]==1){
				if(check[i][j-2][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i][j-1][0]>=1) if(AI[i][j-1][0]<20) AI[i][j-1][0]=20;//33
						if(AI2[k][i][j-1][0]==1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//34
					}
					AI3[1][i][j-1][0]=2;//2チェック
				}
				if(check[i][j-3][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i][j-2][0]>=1) if(AI[i][j-2][0]<20) AI[i][j-2][0]=20;//33
						if(AI2[k][i][j-2][0]==1) if(AI[i][j-2][0]<310) AI[i][j-2][0]=310;//34
					}
					AI3[1][i][j-2][0]=1;//2の飛び3部分チェック
				}
				if(check[i][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i][j+2][0]>=1) if(AI[i][j+2][0]<20) AI[i][j+2][0]=20;//33
						if(AI2[k][i][j+2][0]==1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//34
					}
					AI3[1][i][j+2][0]=2;//2チェック
				}
				if(check[i][j+4][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i][j+3][0]>=1) if(AI[i][j+3][0]<20) AI[i][j+3][0]=20;//33
						if(AI2[k][i][j+3][0]==1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//34
					}
					AI3[1][i][j+3][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i][j+3][0]==3){
				AI3[1][i][j+4][0]=0;//2のリセット
				AI3[1][i][j-1][0]=0;//2のリセット
				AI3[1][i][j+2][0]=0;//2のリセット
				if(check[i][j+2][0]==1){
					if(check[i][j-1][0]==1 || check[i][j+4][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i][j+2][0]==1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//4がストレートの44
							if(AI3[k][i][j+2][0]>=1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//4がストレートの43
						}
						AI2[1][i][j+2][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i][j+4][0]==1) if(AI[i][j+4][0]<310) AI[i][j+4][0]=310;//4が22の44
						if(AI3[k][i][j+4][0]>=1) if(AI[i][j+4][0]<310) AI[i][j+4][0]=310;//4が22の43
						if(AI2[k][i][j-1][0]==1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4が31の44
						if(AI3[k][i][j-1][0]>=1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4が31の43
					}
					AI2[1][i][j+4][0]=1;//飛び3チェック
					AI2[1][i][j-1][0]=1;//飛び3チェック
				}
				if(check[i][j-1][0]==1 && check[i][j+4][0]==1) if(AI[i][j+2][0]<300) AI[i][j+2][0]=300;//21の飛び3
				if(check[i][j+4][0]==3) AI[i][j+2][0]=4000;//22の飛び4
			}
			if(check[i][j-2][0]==3){
				AI3[1][i][j-1][0]=0;//2のリセット
				AI3[1][i][j-3][0]=0;//2のリセット
				AI3[1][i][j+2][0]=0;//2のリセット
				if(check[i][j-1][0]==1){
					if(check[i][j+2][0]==1 || check[i][j-3][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i][j-1][0]==1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4がストレートの44
							if(AI3[k][i][j-1][0]>=1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4がストレートの43
						}
						AI2[1][i][j-1][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i][j+2][0]==1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//4が13の44
						if(AI3[k][i][j+2][0]>=1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//4が13の43
						if(AI2[k][i][j-3][0]==1) if(AI[i][j-3][0]<310) AI[i][j-3][0]=310;//4が22の44
						if(AI3[k][i][j-3][0]>=1) if(AI[i][j-3][0]<310) AI[i][j-3][0]=310;//4が22の43
					}
					AI2[1][i][j+2][0]=1;//飛び3チェック
					AI2[1][i][j-3][0]=1;//飛び3チェック
				}
				if(check[i][j-3][0]==1 && check[i][j+2][0]==1) if(AI[i][j-1][0]<300) AI[i][j-1][0]=300;//12の飛び3
			}
			if(check[i][j+4][0]==3){
				if(check[i][j+2][0]==1 && check[i][j+3][0]==1){
					AI3[1][i][j+2][0]=0;//2のリセット
					AI3[1][i][j+3][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i][j+2][0]==1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//4が31の44
						if(AI3[k][i][j+2][0]>=1) if(AI[i][j+2][0]<310) AI[i][j+2][0]=310;//4が31の43
						if(AI2[k][i][j+3][0]==1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//4が22の44
						if(AI3[k][i][j+3][0]>=1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//4が22の43
					}
					AI2[1][i][j+2][0]=1;//飛び3チェック
					AI2[1][i][j+3][0]=1;//飛び3チェック
				}
			}
			if(check[i][j-3][0]==3){
				if(check[i][j-1][0]==1 && check[i][j-2][0]==1){
					AI3[1][i][j-1][0]=0;//2のリセット
					AI3[1][i][j-2][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i][j-1][0]==1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4が13の44
						if(AI3[k][i][j-1][0]>=1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4が13の43
						if(AI2[k][i][j-2][0]==1) if(AI[i][j-2][0]<310) AI[i][j-2][0]=310;//4が22の44
						if(AI3[k][i][j-2][0]>=1) if(AI[i][j-2][0]<310) AI[i][j-2][0]=310;//4が22の43
					}
					AI2[1][i][j-1][0]=1;//飛び3チェック
					AI2[1][i][j-2][0]=1;//飛び3チェック
				}
			}
			if(check[i][j+2][0]==3){//////////////////////////////////////////////////////////////////////////////
				AI3[1][i][j+3][0]=0;//2のリセット
				AI3[1][i][j+4][0]=0;//2のリセット
				AI3[1][i][j-1][0]=0;//2のリセット
				AI3[1][i][j-2][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i][j-1][0]==1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4がストレートの44
					if(AI3[k][i][j-1][0]>=1) if(AI[i][j-1][0]<310) AI[i][j-1][0]=310;//4がストレートの43
					if(AI2[k][i][j+3][0]==1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//4がストレートの44
					if(AI3[k][i][j+3][0]>=1) if(AI[i][j+3][0]<310) AI[i][j+3][0]=310;//4がストレートの43
				}
				if(check[i][j-1][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i][j-2][0]==1) if(AI[i][j-2][0]<310) AI[i][j-2][0]=310;//4が13の44
						if(AI3[k][i][j-2][0]>=1) if(AI[i][j-2][0]<310) AI[i][j-2][0]=310;//4が13の43
					}
					AI2[1][i][j-2][0]=1;//飛び3チェック
					if(check[i][j+4][0]==1) if(AI[i][j+3][0]<300) AI[i][j+3][0]=300;//3
				}
				if(check[i][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i][j+4][0]==1) if(AI[i][j+4][0]<310) AI[i][j+4][0]=310;//4が31の44
						if(AI3[k][i][j+4][0]>=1) if(AI[i][j+4][0]<310) AI[i][j+4][0]=310;//4が31の43
					}
					AI2[1][i][j+4][0]=1;//飛び3チェック
					if(check[i][j-2][0]==1) if(AI[i][j-1][0]<300) AI[i][j-1][0]=300;//3
				}
				if(check[i][j+4][0]==1 || check[i][j-1][0]==1) AI2[1][i][j+3][0]=1;//3チェック
				if(check[i][j-2][0]==1 || check[i][j+3][0]==1) AI2[1][i][j-1][0]=1;//3チェック
				if(check[i][j+4][0]==3) AI[i][j+3][0]=4000;//31の飛び4
				if(check[i][j-2][0]==3) AI[i][j-1][0]=4000;//13の飛び4
				if(check[i][j+3][0]==3){//////////////////////////////////////////////////////////////////
					AI[i][j+4][0]=4000;//4
					AI[i][j-1][0]=4000;//4
					if(check[i][j+4][0]==3){////////////////////////////////////////////////////////////////
						kekka=1;//5ができていれば1を返して終了。
					}
				}
			}
		}
	}
	
	return kekka;
}

//////////////////////////////////////////////////////////////////////////////////////////////////////

int nanamecheck(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1], int i, int j){//斜めチェック。
	int kekka=0;
	int k;
	
	//逆サイドに置かれてないかを確認した上で3、飛び3は認識させる。
	if(check[i][j][0]==2){//プレイヤー側の判定(右下がり)
		if(check[i+3][j+3][0]==2) if(check[i-1][j-1][0]==1 && check[i+1][j+1][0]==1 && check[i+2][j+2][0]==1 && check[i+4][j+4][0]==1){
			AI5[2][i+1][j+1][0]=1;//飛び飛びの2チェック
			AI5[2][i+2][j+2][0]=1;//飛び飛びの2チェック
		}
		if(check[i+2][j+2][0]==2) if(check[i-1][j-1][0]==1 && check[i+1][j+1][0]==1 && check[i+3][j+3][0]==1){
			for(k=0;k<4;k++){
				if(AI5[k][i+1][j+1][0]>=1) if(AI[i+1][j+1][0]<10) AI[i+1][j+1][0]=10;//33
				if(AI4[k][i+1][j+1][0]==1) if(AI[i+1][j+1][0]<31) AI[i+1][j+1][0]=31;//34
			}
			AI5[2][i+1][j+1][0]=1;//飛び2チェック
			if(check[i-2][j-2][0]==1) AI5[2][i-1][j-1][0]=1;//飛び2チェック
			if(check[i+4][j+4][0]==1) AI5[2][i+3][j+3][0]=1;//飛び2チェック
			if(check[i+4][j+4][0]==2){
				AI5[2][i+1][j+1][0]=0;//2のリセット
				AI5[2][i+3][j+3][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i+1][j+1][0]==1) if(AI[i+1][j+1][0]<31) AI[i+1][j+1][0]=31;//4が31の44
					if(AI5[k][i+1][j+1][0]>=1) if(AI[i+1][j+1][0]<31) AI[i+1][j+1][0]=31;//4が31の43
					if(AI4[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//4が13の44
					if(AI5[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//4が13の43
				}
				AI4[2][i+1][j+1][0]=1;//31の飛び3チェック
				AI4[2][i+3][j+3][0]=1;//13の飛び3チェック
			}
		}
		if(check[i+1][j+1][0]==2){///////////////////////////////////////////////////////////////////////////////
			if(check[i-1][j-1][0]==1 && check[i+2][j+2][0]==1){
				if(check[i-2][j-2][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<10) AI[i-1][j-1][0]=10;//33
						if(AI4[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//34
					}
					AI5[2][i-1][j-1][0]=2;//2チェック
				}
				if(check[i-3][j-3][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i-2][j-2][0]>=1) if(AI[i-2][j-2][0]<10) AI[i-2][j-2][0]=10;//33
						if(AI4[k][i-2][j-2][0]==1) if(AI[i-2][j-2][0]<31) AI[i-2][j-2][0]=31;//34
					}
					AI5[2][i-2][j-2][0]=1;//2の飛び3部分チェック
				}
				if(check[i+3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<10) AI[i+2][j+2][0]=10;//33
						if(AI4[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//34
					}
					AI5[2][i+2][j+2][0]=2;//2チェック
				}
				if(check[i+4][j+4][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<10) AI[i+3][j+3][0]=10;//33
						if(AI4[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//34
					}
					AI5[2][i+3][j+3][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i+3][j+3][0]==2){
				AI5[2][i+4][j+4][0]=0;//2のリセット
				AI5[2][i-1][j-1][0]=0;//2のリセット
				AI5[2][i+2][j+2][0]=0;//2のリセット
				if(check[i+2][j+2][0]==1){
					if(check[i-1][j-1][0]==1 || check[i+4][j+4][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//4がストレートの44
							if(AI5[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//4がストレートの43
						}
						AI4[2][i+2][j+2][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i+4][j+4][0]==1) if(AI[i+4][j+4][0]<31) AI[i+4][j+4][0]=31;//4が22の44
						if(AI5[k][i+4][j+4][0]>=1) if(AI[i+4][j+4][0]<31) AI[i+4][j+4][0]=31;//4が22の43
						if(AI4[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4が31の44
						if(AI5[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4が31の43
					}
					AI4[2][i+4][j+4][0]=1;//飛び3チェック
					AI4[2][i-1][j-1][0]=1;//飛び3チェック
				}
				if(check[i-1][j-1][0]==1 && check[i+4][j+4][0]==1) if(AI[i+2][j+2][0]<30) AI[i+2][j+2][0]=30;//21の飛び3
				if(check[i+4][j+4][0]==2) AI[i+2][j+2][0]=400;//22の飛び4
			}
			if(check[i-2][j-2][0]==2){
				AI5[2][i-1][j-1][0]=0;//2のリセット
				AI5[2][i-3][j-3][0]=0;//2のリセット
				AI5[2][i+2][j+2][0]=0;//2のリセット
				if(check[i-1][j-1][0]==1){
					if(check[i+2][j+2][0]==1 || check[i-3][j-3][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4がストレートの44
							if(AI5[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4がストレートの43
						}
						AI4[2][i-1][j-1][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//4が13の44
						if(AI5[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//4が13の43
						if(AI4[k][i-3][j-3][0]==1) if(AI[i-3][j-3][0]<31) AI[i-3][j-3][0]=31;//4が22の44
						if(AI5[k][i-3][j-3][0]>=1) if(AI[i-3][j-3][0]<31) AI[i-3][j-3][0]=31;//4が22の43
					}
					AI4[2][i+2][j+2][0]=1;//飛び3チェック
					AI4[2][i-3][j-3][0]=1;//飛び3チェック
				}
				if(check[i-3][j-3][0]==1 && check[i+2][j+2][0]==1) if(AI[i-1][j-1][0]<30) AI[i-1][j-1][0]=30;//12の飛び3
			}
			if(check[i+4][j+4][0]==2){
				if(check[i+2][j+2][0]==1 && check[i+3][j+3][0]==1){
					AI5[2][i+2][j+2][0]=0;//2のリセット
					AI5[2][i+3][j+3][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//4が31の44
						if(AI5[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<31) AI[i+2][j+2][0]=31;//4が31の43
						if(AI4[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//4が22の44
						if(AI5[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//4が22の43
					}
					AI4[2][i+2][j+2][0]=1;//飛び3チェック
					AI4[2][i+3][j+3][0]=1;//飛び3チェック
				}
			}
			if(check[i-3][j-3][0]==2){
				if(check[i-1][j-1][0]==1 && check[i-2][j-2][0]==1){
					AI5[2][i-1][j-1][0]=0;//2のリセット
					AI5[2][i-2][j-2][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4が13の44
						if(AI5[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4が13の43
						if(AI4[k][i-2][j-2][0]==1) if(AI[i-2][j-2][0]<31) AI[i-2][j-2][0]=31;//4が22の44
						if(AI5[k][i-2][j-2][0]>=1) if(AI[i-2][j-2][0]<31) AI[i-2][j-2][0]=31;//4が22の43
					}
					AI4[2][i-1][j-1][0]=1;//飛び3チェック
					AI4[2][i-2][j-2][0]=1;//飛び3チェック
				}
			}
			if(check[i+2][j+2][0]==2){//////////////////////////////////////////////////////////////////////////////////////////////
				AI5[2][i+3][j+3][0]=0;//2のリセット
				AI5[2][i+4][j+4][0]=0;//2のリセット
				AI5[2][i-1][j-1][0]=0;//2のリセット
				AI5[2][i-2][j-2][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4がストレートの44
					if(AI5[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<31) AI[i-1][j-1][0]=31;//4がストレートの43
					if(AI4[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//4がストレートの44
					if(AI5[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<31) AI[i+3][j+3][0]=31;//4がストレートの43
				}
				if(check[i-1][j-1][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i-2][j-2][0]==1) if(AI[i-2][j-2][0]<31) AI[i-2][j-2][0]=31;//4が13の44
						if(AI5[k][i-2][j-2][0]>=1) if(AI[i-2][j-2][0]<31) AI[i-2][j-2][0]=31;//4が13の43
					}
					AI4[2][i-2][j-2][0]=1;//飛び3チェック
					if(check[i+4][j+4][0]==1) if(AI[i+3][j+3][0]<30) AI[i+3][j+3][0]=30;//3
				}
				if(check[i+3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i+4][j+4][0]==1) if(AI[i+4][j+4][0]<31) AI[i+4][j+4][0]=31;//4が31の44
						if(AI5[k][i+4][j+4][0]>=1) if(AI[i+4][j+4][0]<31) AI[i+4][j+4][0]=31;//4が31の43
					}
					AI4[2][i+4][j+4][0]=1;//飛び3チェック
					if(check[i-2][j-2][0]==1) if(AI[i-1][j-1][0]<30) AI[i-1][j-1][0]=30;//3
				}
				if(check[i+4][j+4][0]==1 || check[i-1][j-1][0]==1) AI4[2][i+3][j+3][0]=1;//3チェック
				if(check[i-2][j-2][0]==1 || check[i+3][j+3][0]==1) AI4[2][i-1][j-1][0]=1;//3チェック
				if(check[i+4][j+4][0]==2) if(AI[i+3][j+3][0]<400) AI[i+3][j+3][0]=400;//31の飛び4
				if(check[i-2][j-2][0]==2) if(AI[i-1][j-1][0]<400) AI[i-1][j-1][0]=400;//13の飛び4
				if(check[i+3][j+3][0]==2){//////////////////////////////////////////////////////////////////////
					if(AI[i+4][j+4][0]<400) AI[i+4][j+4][0]=400;//4
					if(AI[i-1][j-1][0]<400) AI[i-1][j-1][0]=400;//4
					if(check[i+4][j+4][0]==2){///////////////////////////////////////////////////////////////////
						kekka=1;//5ができてれば1を返して終了。
					}
				}
			}
		}
	}
	
	
	
	if(check[i][j][0]==2){//プレイヤー側の判定(右上がり)
		if(check[i-3][j+3][0]==2) if(check[i+1][j-1][0]==1 && check[i-1][j+1][0]==1 && check[i-2][j+2][0]==1 && check[i-4][j+4][0]==1){
			AI5[3][i-1][j+1][0]=1;//飛び飛びの2チェック
			AI5[3][i-2][j+2][0]=1;//飛び飛びの2チェック
		}
		if(check[i-2][j+2][0]==2) if(check[i+1][j-1][0]==1 && check[i-1][j+1][0]==1 && check[i-3][j+3][0]==1){
			for(k=0;k<4;k++){
				if(AI5[k][i-1][j+1][0]>=1) if(AI[i-1][j+1][0]<10) AI[i-1][j+1][0]=10;//33
				if(AI4[k][i-1][j+1][0]==1) if(AI[i-1][j+1][0]<31) AI[i-1][j+1][0]=31;//34
			}
			AI5[3][i-1][j+1][0]=1;//飛び2チェック
			if(check[i+2][j-2][0]==1) AI5[3][i+1][j-1][0]=1;//飛び2チェック
			if(check[i-4][j+4][0]==1) AI5[3][i-3][j+3][0]=1;//飛び2チェック
			if(check[i-4][j+4][0]==2){
				AI5[3][i-1][j+1][0]=0;//2のリセット
				AI5[3][i-3][j+3][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i-1][j+1][0]==1) if(AI[i-1][j+1][0]<31) AI[i-1][j+1][0]=31;//4が31の44
					if(AI5[k][i-1][j+1][0]>=1) if(AI[i-1][j+1][0]<31) AI[i-1][j+1][0]=31;//4が31の43
					if(AI4[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//4が13の44
					if(AI5[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//4が13の43
				}
				AI4[3][i-1][j+1][0]=1;//31の飛び3チェック
				AI4[3][i-3][j+3][0]=1;//13の飛び3チェック
			}
		}
		if(check[i-1][j+1][0]==2){//////////////////////////////////////////////////////////////////////////////
			if(check[i+1][j-1][0]==1 && check[i-2][j+2][0]==1){
				if(check[i+2][j-2][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<10) AI[i+1][j-1][0]=10;//33
						if(AI4[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//34
					}
					AI5[3][i+1][j-1][0]=2;//2チェック
				}
				if(check[i+3][j-3][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i+2][j-2][0]>=1) if(AI[i+2][j-2][0]<10) AI[i+2][j-2][0]=10;//33
						if(AI4[k][i+2][j-2][0]==1) if(AI[i+2][j-2][0]<31) AI[i+2][j-2][0]=31;//34
					}
					AI5[3][i+2][j-2][0]=1;//2の飛び3部分チェック
				}
				if(check[i-3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<10) AI[i-2][j+2][0]=10;//33
						if(AI4[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//34
					}
					AI5[3][i-2][j+2][0]=2;//2チェック
				}
				if(check[i-4][j+4][0]==1){
					for(k=0;k<4;k++){
						if(AI5[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<10) AI[i-3][j+3][0]=10;//33
						if(AI4[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//34
					}
					AI5[3][i-3][j+3][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i-3][j+3][0]==2){
				AI5[3][i-4][j+4][0]=0;//2のリセット
				AI5[3][i+1][j-1][0]=0;//2のリセット
				AI5[3][i-2][j+2][0]=0;//2のリセット
				if(check[i-2][j+2][0]==1){
					if(check[i+1][j-1][0]==1 || check[i-4][j+4][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//4がストレートの44
							if(AI5[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//4がストレートの43
						}
						AI4[3][i-2][j+2][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i-4][j+4][0]==1) if(AI[i-4][j+4][0]<31) AI[i-4][j+4][0]=31;//4が22の44
						if(AI5[k][i-4][j+4][0]>=1) if(AI[i-4][j+4][0]<31) AI[i-4][j+4][0]=31;//4が22の43
						if(AI4[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4が31の44
						if(AI5[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4が31の43
					}
					AI4[3][i-4][j+4][0]=1;//飛び3チェック
					AI4[3][i+1][j-1][0]=1;//飛び3チェック
				}
				if(check[i+1][j-1][0]==1 && check[i-4][j+4][0]==1) if(AI[i-2][j+2][0]<30) AI[i-2][j+2][0]=30;//21の飛び3
				if(check[i-4][j+4][0]==2) AI[i-2][j+2][0]=400;//22の飛び4
			}
			if(check[i+2][j-2][0]==2){
				AI5[3][i+1][j-1][0]=0;//2のリセット
				AI5[3][i+3][j-3][0]=0;//2のリセット
				AI5[3][i-2][j+2][0]=0;//2のリセット
				if(check[i+1][j-1][0]==1){
					if(check[i-2][j+2][0]==1 || check[i+3][j-3][0]==1){
						for(k=0;k<4;k++){
							if(AI4[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4がストレートの44
							if(AI5[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4がストレートの43
						}
						AI4[3][i+1][j-1][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI4[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//4が13の44
						if(AI5[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//4が13の43
						if(AI4[k][i+3][j-3][0]==1) if(AI[i+3][j-3][0]<31) AI[i+3][j-3][0]=31;//4が22の44
						if(AI5[k][i+3][j-3][0]>=1) if(AI[i+3][j-3][0]<31) AI[i+3][j-3][0]=31;//4が22の43
					}
					AI4[3][i-2][j+2][0]=1;//飛び3チェック
					AI4[3][i+3][j-3][0]=1;//飛び3チェック
				}
				if(check[i+3][j-3][0]==1 && check[i-2][j+2][0]==1) if(AI[i+1][j-1][0]<30) AI[i+1][j-1][0]=30;//12の飛び3
			}
			if(check[i-4][j+4][0]==2){
				if(check[i-2][j+2][0]==1 && check[i-3][j+3][0]==1){
					AI5[3][i-2][j+2][0]=0;//2のリセット
					AI5[3][i-3][j+3][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//4が31の44
						if(AI5[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<31) AI[i-2][j+2][0]=31;//4が31の43
						if(AI4[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//4が22の44
						if(AI5[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//4が22の43
					}
					AI4[3][i-2][j+2][0]=1;//飛び3チェック
					AI4[3][i-3][j+3][0]=1;//飛び3チェック
				}
			}
			if(check[i+3][j-3][0]==2){
				if(check[i+1][j-1][0]==1 && check[i+2][j-2][0]==1){
					AI5[3][i+1][j-1][0]=0;//2のリセット
					AI5[3][i+2][j-2][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI4[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4が13の44
						if(AI5[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4が13の43
						if(AI4[k][i+2][j-2][0]==1) if(AI[i+2][j-2][0]<31) AI[i+2][j-2][0]=31;//4が22の44
						if(AI5[k][i+2][j-2][0]>=1) if(AI[i+2][j-2][0]<31) AI[i+2][j-2][0]=31;//4が22の43
					}
					AI4[3][i+1][j-1][0]=1;//飛び3チェック
					AI4[3][i+2][j-2][0]=1;//飛び3チェック
				}
			}
			if(check[i-2][j+2][0]==2){////////////////////////////////////////////////////////////////////////////////
				AI5[3][i-3][j+3][0]=0;//2のリセット
				AI5[3][i-4][j+4][0]=0;//2のリセット
				AI5[3][i+1][j-1][0]=0;//2のリセット
				AI5[3][i+2][j-2][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI4[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4がストレートの44
					if(AI5[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<31) AI[i+1][j-1][0]=31;//4がストレートの43
					if(AI4[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//4がストレートの44
					if(AI5[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<31) AI[i-3][j+3][0]=31;//4がストレートの43
				}
				if(check[i+1][j-1][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i+2][j-2][0]==1) if(AI[i+2][j-2][0]<31) AI[i+2][j-2][0]=31;//4が13の44
						if(AI5[k][i+2][j-2][0]>=1) if(AI[i+2][j-2][0]<31) AI[i+2][j-2][0]=31;//4が13の43
					}
					AI4[3][i+2][j-2][0]=1;//飛び3チェック
					if(check[i-4][j+4][0]==1) if(AI[i-3][j+3][0]<30) AI[i-3][j+3][0]=30;//3
				}
				if(check[i-3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI4[k][i-4][j+4][0]==1) if(AI[i-4][j+4][0]<31) AI[i-4][j+4][0]=31;//4が31の44
						if(AI5[k][i-4][j+4][0]>=1) if(AI[i-4][j+4][0]<31) AI[i-4][j+4][0]=31;//4が31の43
					}
					AI4[3][i-4][j+4][0]=1;//飛び3チェック
					if(check[i+2][j-2][0]==1) if(AI[i+1][j-1][0]<30) AI[i+1][j-1][0]=30;//3
				}
				if(check[i-4][j+4][0]==1 || check[i+1][j-1][0]==1) AI4[3][i-3][j+3][0]=1;//3チェック
				if(check[i+2][j-2][0]==1 || check[i-3][j+3][0]==1) AI4[3][i+1][j-1][0]=1;//3チェック
				if(check[i-4][j+4][0]==2) if(AI[i-3][j+3][0]<400) AI[i-3][j+3][0]=400;//31の飛び4
				if(check[i+2][j-2][0]==2) if(AI[i+1][j-1][0]<400) AI[i+1][j-1][0]=400;//13の飛び4
				if(check[i-3][j+3][0]==2){///////////////////////////////////////////////////////////////////////////
					if(AI[i-4][j+4][0]<400) AI[i-4][j+4][0]=400;//4
					if(AI[i+1][j-1][0]<400) AI[i+1][j-1][0]=400;//4
					if(check[i-4][j+4][0]==2){///////////////////////////////////////////////////////////////////////
						kekka=1;//5ができてれば1を返して終了。
					}
				}
			}
		}
	}
	
	
	
	if(check[i][j][0]==3){//コンピュータ側の判定(右下がり)
		if(check[i+3][j+3][0]==3) if(check[i-1][j-1][0]==1 && check[i+1][j+1][0]==1 && check[i+2][j+2][0]==1 && check[i+4][j+4][0]==1){
			AI3[2][i+1][j+1][0]=1;//飛び飛びの2チェック
			AI3[2][i+2][j+2][0]=1;//飛び飛びの2チェック
		}
		if(check[i+2][j+2][0]==3) if(check[i-1][j-1][0]==1 && check[i+1][j+1][0]==1 && check[i+3][j+3][0]==1){
			for(k=0;k<4;k++){
				if(AI3[k][i+1][j+1][0]>=1) if(AI[i+1][j+1][0]<20) AI[i+1][j+1][0]=20;//33
				if(AI2[k][i+1][j+1][0]==1) if(AI[i+1][j+1][0]<310) AI[i+1][j+1][0]=310;//34
			}
			AI3[2][i+1][j+1][0]=1;//飛び2チェック
			if(check[i-2][j-2][0]==1) AI3[2][i-1][j-1][0]=1;//飛び2チェック
			if(check[i+4][j+4][0]==1) AI3[2][i+3][j+3][0]=1;//飛び2チェック
			if(check[i+4][j+4][0]==3){
				AI3[2][i+1][j+1][0]=0;//2のリセット
				AI3[2][i+3][j+3][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i+1][j+1][0]==1) if(AI[i+1][j+1][0]<310) AI[i+1][j+1][0]=310;//4が31の44
					if(AI3[k][i+1][j+1][0]>=1) if(AI[i+1][j+1][0]<310) AI[i+1][j+1][0]=310;//4が31の43
					if(AI2[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//4が13の44
					if(AI3[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//4が13の43
				}
				AI2[2][i+1][j+1][0]=1;//31の飛び3チェック
				AI2[2][i+3][j+3][0]=1;//13の飛び3チェック
			}
		}
		if(check[i+1][j+1][0]==3){//////////////////////////////////////////////////////////////////////////////////
			if(check[i-1][j-1][0]==1 && check[i+2][j+2][0]==1){
				if(check[i-2][j-2][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<20) AI[i-1][j-1][0]=20;//33
						if(AI2[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//34
					}
					AI3[2][i-1][j-1][0]=2;//2チェック
				}
				if(check[i-3][j-3][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i-2][j-2][0]>=1) if(AI[i-2][j-2][0]<20) AI[i-2][j-2][0]=20;//33
						if(AI2[k][i-2][j-2][0]==1) if(AI[i-2][j-2][0]<310) AI[i-2][j-2][0]=310;//34
					}
					AI3[2][i-2][j-2][0]=1;//2の飛び3部分チェック
				}
				if(check[i+3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<20) AI[i+2][j+2][0]=20;//33
						if(AI2[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//34
					}
					AI3[2][i+2][j+2][0]=2;//2チェック
				}
				if(check[i+4][j+4][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<20) AI[i+3][j+3][0]=20;//33
						if(AI2[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//34
					}
					AI3[2][i+3][j+3][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i+3][j+3][0]==3){
				AI3[2][i+4][j+4][0]=0;//2のリセット
				AI3[2][i-1][j-1][0]=0;//2のリセット
				AI3[2][i+2][j+2][0]=0;//2のリセット
				if(check[i+2][j+2][0]==1){
					if(check[i-1][j-1][0]==1 || check[i+4][j+4][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//4がストレートの44
							if(AI3[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//4がストレートの43
						}
						AI2[2][i+2][j+2][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i+4][j+4][0]==1) if(AI[i+4][j+4][0]<310) AI[i+4][j+4][0]=310;//4が22の44
						if(AI3[k][i+4][j+4][0]>=1) if(AI[i+4][j+4][0]<310) AI[i+4][j+4][0]=310;//4が22の43
						if(AI2[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4が31の44
						if(AI3[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4が31の43
					}
					AI2[2][i+4][j+4][0]=1;//飛び3チェック
					AI2[2][i-1][j-1][0]=1;//飛び3チェック
				}
				if(check[i-1][j-1][0]==1 && check[i+4][j+4][0]==1) if(AI[i+2][j+2][0]<300) AI[i+2][j+2][0]=300;//21の飛び3
				if(check[i+4][j+4][0]==3) AI[i+2][j+2][0]=4000;//22の飛び4
			}
			if(check[i-2][j-2][0]==3){
				AI3[2][i-1][j-1][0]=0;//2のリセット
				AI3[2][i-3][j-3][0]=0;//2のリセット
				AI3[2][i+2][j+2][0]=0;//2のリセット
				if(check[i-1][j-1][0]==1){
					if(check[i+2][j+2][0]==1 || check[i-3][j-3][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4がストレートの44
							if(AI3[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4がストレートの43
						}
						AI2[2][i-1][j-1][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//4が13の44
						if(AI3[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//4が13の43
						if(AI2[k][i-3][j-3][0]==1) if(AI[i-3][j-3][0]<310) AI[i-3][j-3][0]=310;//4が22の44
						if(AI3[k][i-3][j-3][0]>=1) if(AI[i-3][j-3][0]<310) AI[i-3][j-3][0]=310;//4が22の43
					}
					AI2[2][i+2][j+2][0]=1;//飛び3チェック
					AI2[2][i-3][j-3][0]=1;//飛び3チェック
				}
				if(check[i-3][j-3][0]==1 && check[i+2][j+2][0]==1) if(AI[i-1][j-1][0]<300) AI[i-1][j-1][0]=300;//12の飛び3
			}
			if(check[i+4][j+4][0]==3){
				if(check[i+2][j+2][0]==1 && check[i+3][j+3][0]==1){
					AI3[2][i+2][j+2][0]=0;//2のリセット
					AI3[2][i+3][j+3][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i+2][j+2][0]==1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//4が31の44
						if(AI3[k][i+2][j+2][0]>=1) if(AI[i+2][j+2][0]<310) AI[i+2][j+2][0]=310;//4が31の43
						if(AI2[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//4が22の44
						if(AI3[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//4が22の43
					}
					AI2[2][i+2][j+2][0]=1;//飛び3チェック
					AI2[2][i+3][j+3][0]=1;//飛び3チェック
				}
			}
			if(check[i-3][j-3][0]==3){
				if(check[i-1][j-1][0]==1 && check[i-2][j-2][0]==1){
					AI3[2][i-1][j-1][0]=0;//2のリセット
					AI3[2][i-2][j-2][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4が13の44
						if(AI3[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4が13の43
						if(AI2[k][i-2][j-2][0]==1) if(AI[i-2][j-2][0]<310) AI[i-2][j-2][0]=310;//4が22の44
						if(AI3[k][i-2][j-2][0]>=1) if(AI[i-2][j-2][0]<310) AI[i-2][j-2][0]=310;//4が22の43
					}
					AI2[2][i-1][j-1][0]=1;//飛び3チェック
					AI2[2][i-2][j-2][0]=1;//飛び3チェック
				}
			}
			if(check[i+2][j+2][0]==3){/////////////////////////////////////////////////////////////////////////////////
				AI3[2][i+3][j+3][0]=0;//2のリセット
				AI3[2][i+4][j+4][0]=0;//2のリセット
				AI3[2][i-1][j-1][0]=0;//2のリセット
				AI3[2][i-2][j-2][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i-1][j-1][0]==1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4がストレートの44
					if(AI3[k][i-1][j-1][0]>=1) if(AI[i-1][j-1][0]<310) AI[i-1][j-1][0]=310;//4がストレートの43
					if(AI2[k][i+3][j+3][0]==1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//4がストレートの44
					if(AI3[k][i+3][j+3][0]>=1) if(AI[i+3][j+3][0]<310) AI[i+3][j+3][0]=310;//4がストレートの43
				}
				if(check[i-1][j-1][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i-2][j-2][0]==1) if(AI[i-2][j-2][0]<310) AI[i-2][j-2][0]=310;//4が13の44
						if(AI3[k][i-2][j-2][0]>=1) if(AI[i-2][j-2][0]<310) AI[i-2][j-2][0]=310;//4が13の43
					}
					AI2[2][i-2][j-2][0]=1;//飛び3チェック
					if(check[i+4][j+4][0]==1) if(AI[i+3][j+3][0]<300) AI[i+3][j+3][0]=300;//3
				}
				if(check[i+3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i+4][j+4][0]==1) if(AI[i+4][j+4][0]<310) AI[i+4][j+4][0]=310;//4が31の44
						if(AI3[k][i+4][j+4][0]>=1) if(AI[i+4][j+4][0]<310) AI[i+4][j+4][0]=310;//4が31の43
					}
					AI2[2][i+4][j+4][0]=1;//飛び3チェック
					if(check[i-2][j-2][0]==1) if(AI[i-1][j-1][0]<300) AI[i-1][j-1][0]=300;//3
				}
				if(check[i+4][j+4][0]==1 || check[i-1][j-1][0]==1) AI2[2][i+3][j+3][0]=1;//3チェック
				if(check[i-2][j-2][0]==1 || check[i+3][j+3][0]==1) AI2[2][i-1][j-1][0]=1;//3チェック
				if(check[i+4][j+4][0]==3) AI[i+3][j+3][0]=4000;//31の飛び4
				if(check[i-2][j-2][0]==3) AI[i][j-1][0]=4000;//13の飛び4
				if(check[i+3][j+3][0]==3){////////////////////////////////////////////////////////////////////////////
					AI[i+4][j+4][0]=4000;//4
					AI[i-1][j-1][0]=4000;//4
					if(check[i+4][j+4][0]==3){////////////////////////////////////////////////////////////////////////
						kekka=1;//5ができていれば1を返して終了。
					}
				}
			}
		}
	}
	
	
	
	if(check[i][j][0]==3){//コンピュータ側の判定(右上がり)
		if(check[i-3][j+3][0]==3) if(check[i+1][j-1][0]==1 && check[i-1][j+1][0]==1 && check[i-2][j+2][0]==1 && check[i-4][j+4][0]==1){
			AI3[3][i-1][j+1][0]=1;//飛び飛びの2チェック
			AI3[3][i-2][j+2][0]=1;//飛び飛びの2チェック
		}
		if(check[i-2][j+2][0]==3) if(check[i+1][j-1][0]==1 && check[i-1][j+1][0]==1 && check[i-3][j+3][0]==1){
			for(k=0;k<4;k++){
				if(AI3[k][i-1][j+1][0]>=1) if(AI[i-1][j+1][0]<20) AI[i-1][j+1][0]=20;//33
				if(AI2[k][i-1][j+1][0]==1) if(AI[i-1][j+1][0]<310) AI[i-1][j+1][0]=310;//34
			}
			AI3[3][i-1][j+1][0]=1;//飛び2チェック
			if(check[i+2][j-2][0]==1) AI3[3][i+1][j-1][0]=1;//飛び2チェック
			if(check[i-4][j+4][0]==1) AI3[3][i-3][j+3][0]=1;//飛び2チェック
			if(check[i-4][j+4][0]==3){
				AI3[3][i-1][j+1][0]=0;//2のリセット
				AI3[3][i-3][j+3][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i-1][j+1][0]==1) if(AI[i-1][j+1][0]<310) AI[i-1][j+1][0]=310;//4が31の44
					if(AI3[k][i-1][j+1][0]>=1) if(AI[i-1][j+1][0]<310) AI[i-1][j+1][0]=310;//4が31の43
					if(AI2[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//4が13の44
					if(AI3[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//4が13の43
				}
				AI2[3][i-1][j+1][0]=1;//31の飛び3チェック
				AI2[3][i-3][j+3][0]=1;//13の飛び3チェック
			}
		}
		if(check[i-1][j+1][0]==3){///////////////////////////////////////////////////////////////////////////////////
			if(check[i+1][j-1][0]==1 && check[i-2][j+2][0]==1){
				if(check[i+2][j-2][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<20) AI[i+1][j-1][0]=20;//33
						if(AI2[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=30;//34
					}
					AI3[3][i+1][j-1][0]=2;//2チェック
				}
				if(check[i+3][j-3][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i+2][j-2][0]>=1) if(AI[i+2][j-2][0]<20) AI[i+2][j-2][0]=20;//33
						if(AI2[k][i+2][j-2][0]==1) if(AI[i+2][j-2][0]<310) AI[i+2][j-2][0]=310;//34
					}
					AI3[3][i+2][j-2][0]=1;//2の飛び3部分チェック
				}
				if(check[i-3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<20) AI[i-2][j+2][0]=20;//33
						if(AI2[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//34
					}
					AI3[3][i-2][j+2][0]=2;//2チェック
				}
				if(check[i-4][j+4][0]==1){
					for(k=0;k<4;k++){
						if(AI3[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<20) AI[i-3][j+3][0]=20;//33
						if(AI2[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//34
					}
					AI3[3][i-3][j+3][0]=1;//2の飛び3部分チェック
				}
			}
			if(check[i-3][j+3][0]==3){
				AI3[3][i-4][j+4][0]=0;//2のリセット
				AI3[3][i+1][j-1][0]=0;//2のリセット
				AI3[3][i-2][j+2][0]=0;//2のリセット
				if(check[i-2][j+2][0]==1){
					if(check[i+1][j-1][0]==1 || check[i-4][j+4][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//4がストレートの44
							if(AI3[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//4がストレートの43
						}
						AI2[3][i-2][j+2][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i-4][j+4][0]==1) if(AI[i-4][j+4][0]<310) AI[i-4][j+4][0]=310;//4が22の44
						if(AI3[k][i-4][j+4][0]>=1) if(AI[i-4][j+4][0]<310) AI[i-4][j+4][0]=310;//4が22の43
						if(AI2[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4が31の44
						if(AI3[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4が31の43
					}
					AI2[3][i-4][j+4][0]=1;//飛び3チェック
					AI2[3][i+1][j-1][0]=1;//飛び3チェック
				}
				if(check[i+1][j-1][0]==1 && check[i-4][j+4][0]==1) if(AI[i-2][j+2][0]<300) AI[i-2][j+2][0]=300;//21の飛び3
				if(check[i-4][j+4][0]==3) AI[i-2][j+2][0]=4000;//22の飛び4
			}
			if(check[i+2][j-2][0]==3){
				AI3[3][i+1][j-1][0]=0;//2のリセット
				AI3[3][i+3][j-3][0]=0;//2のリセット
				AI3[3][i-2][j+2][0]=0;//2のリセット
				if(check[i+1][j-1][0]==1){
					if(check[i-2][j+2][0]==1 || check[i+3][j-3][0]==1){
						for(k=0;k<4;k++){
							if(AI2[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4がストレートの44
							if(AI3[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4がストレートの43
						}
						AI2[3][i+1][j-1][0]=1;//飛び3チェック
					}
					for(k=0;k<4;k++){
						if(AI2[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//4が13の44
						if(AI3[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//4が13の43
						if(AI2[k][i+3][j-3][0]==1) if(AI[i+3][j-3][0]<310) AI[i+3][j-3][0]=310;//4が22の44
						if(AI3[k][i+3][j-3][0]>=1) if(AI[i+3][j-3][0]<310) AI[i+3][j-3][0]=310;//4が22の43
					}
					AI2[3][i-2][j+2][0]=1;//飛び3チェック
					AI2[3][i+3][j-3][0]=1;//飛び3チェック
				}
				if(check[i+3][j-3][0]==1 && check[i-2][j+2][0]==1) if(AI[i+1][j-1][0]<300) AI[i+1][j-1][0]=300;//12の飛び3
			}
			if(check[i-4][j+4][0]==3){
				if(check[i-2][j+2][0]==1 && check[i-3][j+3][0]==1){
					AI3[3][i-2][j+2][0]=0;//2のリセット
					AI3[3][i-3][j+3][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i-2][j+2][0]==1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//4が31の44
						if(AI3[k][i-2][j+2][0]>=1) if(AI[i-2][j+2][0]<310) AI[i-2][j+2][0]=310;//4が31の43
						if(AI2[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//4が22の44
						if(AI3[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//4が22の43
					}
					AI2[3][i-2][j+2][0]=1;//飛び3チェック
					AI2[3][i-3][j+3][0]=1;//飛び3チェック
				}
			}
			if(check[i+3][j-3][0]==3){
				if(check[i+1][j-1][0]==1 && check[i+2][j-2][0]==1){
					AI3[3][i+1][j-1][0]=0;//2のリセット
					AI3[3][i+2][j-2][0]=0;//2のリセット
					for(k=0;k<4;k++){
						if(AI2[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4が13の44
						if(AI3[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4が13の43
						if(AI2[k][i+2][j-2][0]==1) if(AI[i+2][j-2][0]<310) AI[i+2][j-2][0]=310;//4が22の44
						if(AI3[k][i+2][j-2][0]>=1) if(AI[i+2][j-2][0]<310) AI[i+2][j-2][0]=310;//4が22の43
					}
					AI2[3][i+1][j-1][0]=1;//飛び3チェック
					AI2[3][i+2][j-2][0]=1;//飛び3チェック
				}
			}
			if(check[i-2][j+2][0]==3){//////////////////////////////////////////////////////////////////////////////////
				AI3[3][i-3][j+3][0]=0;//2のリセット
				AI3[3][i-4][j+4][0]=0;//2のリセット
				AI3[3][i+1][j-1][0]=0;//2のリセット
				AI3[3][i+2][j-2][0]=0;//2のリセット
				for(k=0;k<4;k++){
					if(AI2[k][i+1][j-1][0]==1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4がストレートの44
					if(AI3[k][i+1][j-1][0]>=1) if(AI[i+1][j-1][0]<310) AI[i+1][j-1][0]=310;//4がストレートの43
					if(AI2[k][i-3][j+3][0]==1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//4がストレートの44
					if(AI3[k][i-3][j+3][0]>=1) if(AI[i-3][j+3][0]<310) AI[i-3][j+3][0]=310;//4がストレートの43
				}
				if(check[i+1][j-1][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i+2][j-2][0]==1) if(AI[i+2][j-2][0]<310) AI[i+2][j-2][0]=310;//4が13の44
						if(AI3[k][i+2][j-2][0]>=1) if(AI[i+2][j-2][0]<310) AI[i+2][j-2][0]=310;//4が13の43
					}
					AI2[3][i+2][j-2][0]=1;//飛び3チェック
					if(check[i-4][j+4][0]==1) if(AI[i-3][j+3][0]<300) AI[i-3][j+3][0]=300;//3
				}
				if(check[i-3][j+3][0]==1){
					for(k=0;k<4;k++){
						if(AI2[k][i-4][j+4][0]==1) if(AI[i-4][j+4][0]<310) AI[i-4][j+4][0]=310;//4が31の44
						if(AI3[k][i-4][j+4][0]>=1) if(AI[i-4][j+4][0]<310) AI[i-4][j+4][0]=310;//4が31の43
					}
					AI2[3][i-4][j+4][0]=1;//飛び3チェック
					if(check[i+2][j-2][0]==1) if(AI[i+1][j-1][0]<300) AI[i+1][j-1][0]=300;//3
				}
				if(check[i-4][j+4][0]==1 || check[i+1][j-1][0]==1) AI2[3][i-3][j+3][0]=1;//3チェック
				if(check[i+2][j-2][0]==1 || check[i-3][j+3][0]==1) AI2[3][i+1][j-1][0]=1;//3チェック
				if(check[i-4][j+4][0]==3) AI[i-3][j+3][0]=4000;//31の飛び4
				if(check[i+2][j-2][0]==3) AI[i+1][j-1][0]=4000;//13の飛び4
				if(check[i-3][j+3][0]==3){/////////////////////////////////////////////////////////////////////////////
					AI[i-4][j+4][0]=4000;//4
					AI[i+1][j-1][0]=4000;//4
					if(check[i-4][j+4][0]==3){///////////////////////////////////////////////////////////////////////////
						kekka=1;//5ができてれば1を返して終了。
					}
				}
			}
		}
	}
	
	
	return kekka;
}






/////////////////////////////////////////////////////////////////////////////////////////////////////////

int hantei(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1]){//揃ってるかチェック。
	int i,j;
	int kekka=0;
	int flag=0;
	
	for(i=0;i<15;i++){
		for(j=0;j<15;j++){
			if(tatecheck(check,AI,AI2,AI3,AI4,AI5,i,j)){
				flag=1;
				break;
			}
			if(yokocheck(check,AI,AI2,AI3,AI4,AI5,i,j)){
				flag=1;
				break;
			}
			if(nanamecheck(check,AI,AI2,AI3,AI4,AI5,i,j)){
				flag=1;
				break;
			}
		}
		if(flag) break;
	}
	if(flag) kekka=1;
	
	return kekka;
}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

int owari(int check[100][100][1]){//マスが残ってるかチェック。
	int i,j;
	int kekka=1;
	
	for(i=0;i<15;i++){
		for(j=0;j<15;j++){
			if(check[i][j][0]==1) kekka=0;//空いてるマスがあるかどうか。
		}
	}
	
	return kekka;
}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
void AIkakunin(int check[100][100][1], int AI[100][100][1], int AI2[4][100][100][1], int AI3[4][100][100][1], int AI4[4][100][100][1], int AI5[4][100][100][1]){//AI確認用
	int i,j,k;
	
	printf("    1  2  3  4  5  6  7  8  9  10 11 12 13 14 15\n");
	
	for(i=0;i<15;i++){
		printf("%2d ",i+1);//頭の数を表示。
		for(j=0;j<15;j++){
			printf("%2d ",check[i][j][0]);
		}
		printf("\n");//行終わりに改行。
	}
	
	printf("\n");
	
	printf("    1  2  3  4  5  6  7  8  9  10 11 12 13 14 15\n");
	
	for(i=0;i<15;i++){
		printf("%2d ",i+1);//頭の数を表示。
		for(j=0;j<15;j++){
			printf("%2d ",AI[i][j][0]);
		}
		printf("\n");//行終わりに改行。
	}
	
	printf("\n");
	
	
	for(k=0;k<4;k++){
		printf("    1  2  3  4  5  6  7  8  9  10 11 12 13 14 15\n");
		
		for(i=0;i<15;i++){
			printf("%2d ",i+1);//頭の数を表示。
			for(j=0;j<15;j++){
				printf("%2d ",AI2[k][i][j][0]);
			}
			printf("\n");//行終わりに改行。
		}
		
		printf("\n");
	}
	
	for(k=0;k<4;k++){
		printf("    1  2  3  4  5  6  7  8  9  10 11 12 13 14 15\n");
		
		for(i=0;i<15;i++){
			printf("%2d ",i+1);//頭の数を表示。
			for(j=0;j<15;j++){
				printf("%2d ",AI3[k][i][j][0]);
			}
			printf("\n");//行終わりに改行。
		}
		
		printf("\n");
	}
	
	for(k=0;k<4;k++){
		printf("    1  2  3  4  5  6  7  8  9  10 11 12 13 14 15\n");
		
		for(i=0;i<15;i++){
			printf("%2d ",i+1);//頭の数を表示。
			for(j=0;j<15;j++){
				printf("%2d ",AI4[k][i][j][0]);
			}
			printf("\n");//行終わりに改行。
		}
		
		printf("\n");
	}
	
	for(k=0;k<4;k++){
		printf("    1  2  3  4  5  6  7  8  9  10 11 12 13 14 15\n");
		
		for(i=0;i<15;i++){
			printf("%2d ",i+1);//頭の数を表示。
			for(j=0;j<15;j++){
				printf("%2d ",AI5[k][i][j][0]);
			}
			printf("\n");//行終わりに改行。
		}
		
		printf("\n");
	}
}
*/
